{
  "activation_dropout": 0.5,
  "apply_spec_augment": true,
  "architectures": [
    "Wav2Vec2ForPreTraining"
  ],
  "attention_dropout": 0.5,
  "classifier_proj_size": 32,
  "codevector_dim": 512,
  "contrastive_logits_temperature": 0.1,
  "conv_bias": true,
  "conv_dim": [
    512,
    512,
    512,
    512,
    512
  ],
  "conv_kernel": [
    10,
    3,
    3,
    2,
    2
  ],
  "conv_stride": [
    5,
    2,
    2,
    2,
    2
  ],
  "ctc_loss_reduction": "sum",
  "ctc_zero_infinity": false,
  "diversity_loss_weight": 0.1,
  "do_stable_layer_norm": true,
  "feat_extract_activation": "gelu",
  "feat_extract_dropout": 0.5,
  "feat_extract_norm": "layer",
  "feat_proj_dropout": 0.5,
  "feat_quantizer_dropout": 0.5,
  "final_dropout": 0.5,
  "hidden_act": "gelu",
  "hidden_dropout": 0.5,
  "hidden_dropout_prob": 0.5,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-05,
  "layerdrop": 0.1,
  "mask_feature_length": 10,
  "mask_feature_prob": 0.0,
  "mask_time_length": 10,
  "mask_time_prob": 0.65,
  "model_type": "wav2vec2",
  "num_attention_heads": 12,
  "num_codevector_groups": 2,
  "num_codevectors_per_group": 32,
  "num_conv_pos_embedding_groups": 16,
  "num_conv_pos_embeddings": 64,
  "num_feat_extract_layers": 7,
  "num_hidden_layers": 12,
  "num_negatives": 100,
  "pad_token_id": 0,
  "proj_codevector_dim": 128,
  "use_weighted_layer_sum": false
}